# series in pandas

In [3]:
import pandas as pd
var=pd.Series()
print(var)

Series([], dtype: float64)

C:\Users\hp\AppData\Local\Temp\ipykernel_12784\215323928.py:2: FutureWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  var=pd.Series()

# series programs

In [4]:
import pandas as pd
x=[3,4,5,6,7]
var=pd.Series(x)
print(var)
print(type(var))
#to get values use index number
print(var[2])

0    3
1    4
2    5
3    6
4    7
dtype: int64
<class 'pandas.core.series.Series'>
5

In [5]:
#to change the index number
import pandas as pd
x=[3,4,5,6,7]
var=pd.Series(x,index=["A","E","I","O","U"])
print(var)
print(type(var))
print(var[2])

A    3
E    4
I    5
O    6
U    7
dtype: int64
<class 'pandas.core.series.Series'>
5

In [6]:
#to change type of data use dtype
import pandas as pd
x=[3,4,5,6,7]
var=pd.Series(x,index=["A","E","I","O","U"],dtype="float")
print(var)
print(type(var))
print(var[2])

A    3.0
E    4.0
I    5.0
O    6.0
U    7.0
dtype: float64
<class 'pandas.core.series.Series'>
5.0

In [8]:
#name of the data can be given in pandas
import pandas as pd
x=[3,4,5,6,7]
var=pd.Series(x,index=["A","E","I","O","U"],dtype="float",name="Python")
print(var)
print(type(var))
print(var["I"])

A    3.0
E    4.0
I    5.0
O    6.0
U    7.0
Name: Python, dtype: float64
<class 'pandas.core.series.Series'>
5.0

In [9]:
#in series we can pass dictionary , tuple ,set
dic={"name":["Python","C","C++","Java"],
     "por":[12,13,14,15],
    "rank":[1,4,3,2]}
var=pd.Series(dic)
print(var)
print(type(var))

name    [Python, C, C++, Java]
por           [12, 13, 14, 15]
rank              [1, 4, 3, 2]
dtype: object
<class 'pandas.core.series.Series'>

In [10]:
#using single data
import pandas as pd
var=pd.Series(12)
print(var)
print(type(var))

0    12
dtype: int64
<class 'pandas.core.series.Series'>

In [11]:
#using single data and multiple series
import pandas as pd
var=pd.Series(12,index=[1,2,3,4,5])
print(var)
print(type(var))

1    12
2    12
3    12
4    12
5    12
dtype: int64
<class 'pandas.core.series.Series'>

In [12]:
#in pandas broadcasting is not there which is a great advantage
import pandas as pd
var1=pd.Series(12,index=[1,2,3,4,5,6,7])
var2=pd.Series(12,index=[1,2,3])
print(var1+var2)
print(type(var1+var2))

1    24.0
2    24.0
3    24.0
4     NaN
5     NaN
6     NaN
7     NaN
dtype: float64
<class 'pandas.core.series.Series'>

# DATAFRAME

In [13]:
# 1) it is possible in lists,tuples,dictionaries
# 2)it is defined as 2 d array that is capable of storing various datatypes
import pandas as pd
l=[1,2,3,4,5,6]
var=pd.DataFrame(l)
print(var)
print(type(var))

   0
0  1
1  2
2  3
3  4
4  5
5  6
<class 'pandas.core.frame.DataFrame'>

In [14]:
#using dictionary
d={"a":[1,2,3,4,5],
   "s":[1,2,3,4,5]}
var=pd.DataFrame(d)
print(var)
print(type(var))

   a  s
0  1  1
1  2  2
2  3  3
3  4  4
4  5  5
<class 'pandas.core.frame.DataFrame'>

In [16]:
#to want that particular column
d={"a":[1,2,3,4,5],
   "s":[1,2,3,4,5],
   "d":[1,2,3,4,5],
   1:[1,2,3,4,5]}
var=pd.DataFrame(d)
print(var)
print(type(var))
print()
#to want that particular column
var1=pd.DataFrame(d,columns=["a"])
print(var1)

   a  s  d  t
0  1  1  1  1
1  2  2  2  2
2  3  3  3  3
3  4  4  4  4
4  5  5  5  5
<class 'pandas.core.frame.DataFrame'>

   a
0  1
1  2
2  3
3  4
4  5

In [18]:
#if u want multiple columns
var2=pd.DataFrame(d,columns=["a","s"])
print(var2)

   a  s
0  1  1
1  2  2
2  3  3
3  4  4
4  5  5

In [19]:
#to change index number
var3=pd.DataFrame(d,columns=["a","s"],index=["a","e","i","o","u"])
print(var3)

   a  s
a  1  1
e  2  2
i  3  3
o  4  4
u  5  5

In [21]:
#to get values
print(var3["s"][3])
print(var3["a"][0])

4
1

In [22]:
#using list
lists1=[[11,12,13,14,15],[1,2,3,4,5]]
var=pd.DataFrame(lists1)
print(var)

    0   1   2   3   4
0  11  12  13  14  15
1   1   2   3   4   5

# using series create DataFrame

In [28]:
sr= {"s":pd.Series([1,2,3,14,5]),
     "a":pd.Series([1,2,3,4,5]),
     "d":pd.Series([9,8,7,6,5])}
var=pd.DataFrame(sr)
print(var)
print(type(var))
print(var["s"][3])

    s  a  d
0   1  1  9
1   2  2  8
2   3  3  7
3  14  4  6
4   5  5  5
<class 'pandas.core.frame.DataFrame'>
14

# aritmatic operations in pandas

In [29]:
import pandas as pd
var=pd.DataFrame({"A":[1,2,3,4],"B":[5,6,7,8]})
var

   A  B
0  1  5
1  2  6
2  3  7
3  4  8

In [30]:
var["C"]=var["A"]+var["B"]
var

   A  B   C
0  1  5   6
1  2  6   8
2  3  7  10
3  4  8  12

In [31]:
var["C"]=var["A"]-var["B"]
var

   A  B  C
0  1  5 -4
1  2  6 -4
2  3  7 -4
3  4  8 -4

In [32]:
var["C"]=var["A"]*var["B"]
var

   A  B   C
0  1  5   5
1  2  6  12
2  3  7  21
3  4  8  32

In [33]:
var["C"]=var["A"]/var["B"]
var

   A  B         C
0  1  5  0.200000
1  2  6  0.333333
2  3  7  0.428571
3  4  8  0.500000

In [35]:
var["C"]=var["A"]**var["B"]
var

   A  B      C
0  1  5      1
1  2  6     64
2  3  7   2187
3  4  8  65536

# logical approach in arithmatic operators

In [37]:
var1=pd.DataFrame({"A":[10,20,30,40],"B":[15,16,17,18]})
var1["Python"]=var1["A"]<=20
var1

    A   B  Python
0  10  15    True
1  20  16    True
2  30  17   False
3  40  18   False

In [38]:
var1["Python1"]=var1["B"]
var1

    A   B  Python  Python1
0  10  15    True       15
1  20  16    True       16
2  30  17   False       17
3  40  18   False       18